src/Low_Latency_Programming/systemtap.org
#+SETUPFILE: ~/.emacs.d/src/org-templates/level-1.org
#+TITLE: Systemtap
#+OPTIONS: num:nil H:2

* Overview
SystemTap provides the infrastructure to monitor the running Linux
kernel for detailed analysis. This can assist administrators and
developers in identifying the underlying cause of a bug or performance
problem.

Without SystemTap, monitoring the activity of a running kernel would
require a tedious instrument, recompile, install, and reboot sequence.
SystemTap is designed to eliminate this and allows users to gather the
same information by running user-written SystemTap scripts.

+ [[https://sourceware.org/systemtap/wiki][SystemTap’s homepage wiki]]
+ [[https://access.redhat.com/documentation/en-US/Red_Hat_Enterprise_Linux/6/html/SystemTap_Beginners_Guide/][SystemTap Beginners Guide by Redhat]]

* Examples
+ [[https://sourceware.org/systemtap/examples/][homepage examples]]
+ [[http://blog.jeffli.me/blog/2014/10/10/install-systemtap-in-ubuntu-14-dot-04/][systemtap in ubuntu]]
