public_html/Low_Latency_Programming/systemtap.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Systemtap</title>
<!-- 2016-01-28 Thu 21:51 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Shi Shougang" />
<link href="../assets/bootstrap.min.css" rel="stylesheet" media="screen">
<link href="../assets/bootstrap-responsive.min.css" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="../assets/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">Systemtap</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Overview</a></li>
<li><a href="#sec-2">Examples</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Overview</h2>
<div class="outline-text-2" id="text-1">
<p>
SystemTap provides the infrastructure to monitor the running Linux
kernel for detailed analysis. This can assist administrators and
developers in identifying the underlying cause of a bug or performance
problem.
</p>

<p>
Without SystemTap, monitoring the activity of a running kernel would
require a tedious instrument, recompile, install, and reboot sequence.
SystemTap is designed to eliminate this and allows users to gather the
same information by running user-written SystemTap scripts.
</p>

<ul class="org-ul">
<li><a href="https://sourceware.org/systemtap/wiki">SystemTap’s homepage wiki</a>
</li>
<li><a href="https://access.redhat.com/documentation/en-US/Red_Hat_Enterprise_Linux/6/html/SystemTap_Beginners_Guide/">SystemTap Beginners Guide by Redhat</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Examples</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="https://sourceware.org/systemtap/examples/">homepage examples</a>
</li>
<li><a href="http://blog.jeffli.me/blog/2014/10/10/install-systemtap-in-ubuntu-14-dot-04/">systemtap in ubuntu</a>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shi Shougang</p>
<p class="date">Created: 2016-01-28 Thu 21:51</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
